{
  "body": {
    "expanded_query": false,
    "approximate_result_count": 1,
    "pages": {
      "current": 3,
      "total": 3
    },
    "offers": [
      {
        "merchant": "Scan Computers",
        "description": "Like A Computer, Unlike Any Computer If the computer were invented today, what would it look like? It would be powerful enough for any task. So mobile you could take it everywhere. And so intuitive you could use it any way you wanted   with touch, a keyboard or even a pencil. In other words, it wouldn t really be a  computer . It would be the new iPad. A10 Fusion Chip Engineered For Performance 64-bit architecture. Four-core design. Over 3.3 billion transistors. Translation: iPad is incredibly fast. Which comes in handy when you want to edit a 4K video, play graphics-intensive games or experience the latest augmented reality apps. It Multitasks Easily, So You Can Too iPad packs enough power to use multiple apps all at once. Work on your business plan while doing research on the web while making a FaceTime call to a colleague at the same time. It s even easier than it sounds. The Most Immersive Way to Experience Augmented Reality Augmented reality (AR) is a new technology that brings virtual objects into the real world. And every aspect of iPad   from the display to the processing power to the cameras to the motion sensors   is designed to make AR apps more magical than ever before.    Augmented reality apps fundamentally change what you re capable of. Learn something new whether you re inside or outside a classroom. Solve everyday problems. Immerse yourself in entertainment and games. With iPad and AR, the possibilities are endless. Apple Pencil, Dream It Up, Jot It Down iPad has always been a great way to get what s in your mind down on the page. And now you have a new way to do it. Write notes, paint a watercolour or sign a lease. With Apple Pencil, you ll do it all with pixel-perfect precision and responsiveness. Use it as naturally as you would a pencil, while doing a whole lot more than you would with one. Two Great Cameras That Do More than Take Great Photos Built-in front and back cameras allow you to shoot gorgeous photos and cinematic videos, scan documents, make FaceTime calls or even create a floor plan using augmented reality. Connect and Compose With Any Bluetooth Keyboard Need to sit down and hammer out a research project, email or your blockbuster screenplay? iPad has an intuitive onscreen keyboard, but it s also compatible with all kinds of Bluetooth keyboards. Loaded with Powerful Built-In Apps Cut a track with GarageBand, make a compelling presentation with Keynote, or shoot and edit a short film with iMovie. iPad comes with a collection of apps from Apple so you can start creating straight out of the box. With Over a Million Apps for iPad, iPad can Do Countless Things Every one of the 1.3 million iPad apps has been designed specifically for the large iPad display. There are apps for anything you want to do   photography, drawing or just getting some work done. And finding your new favourite apps is as easy as visiting the App Store, where our editors are always curating the best of what s new and noteworthy. Thin, Light, Durable, and In Three Great Finishes At less than half a kilo and only 7.5mm thin, iPad is a breeze to take wherever you go. It s built to be durable, so you have peace of mind knowing you can take it anywhere. And it s just as beautiful as it is portable   available in silver, space grey and a new gold. 10 Hours of Battery Life on a Single Charge With all-day battery life, iPad gives you more time to surf, write, draw, work, shop and whatever else you need to do between charges. Keep All Your Stuff Safe, Organised and Always With You iCloud keeps things like your photos, files and notes safe and conveniently available on all your devices. And the Files app puts all your files of any type in one place, including those you store with cloud services like Google Drive, OneDrive and Box. Swipe, Pinch, Tap. It s That Easy iPad is designed so that using it feels like second nature, even if you never have before. Multi-Touch gestures let you do things like browse photos, edit documents and organise your files simply by touching the beautiful 9.7-inch Retina display. Dock, Get To Your Favourite Apps Fast With iOS 11, the new Dock is just a swipe away. So it s easy to get to an app from another app without having to go back to the Home screen. Add your favourite apps to the Dock. Or multitask in a flash by opening apps directly from it. Drag From Here, Drop to There Designed specifically for Multi-Touch, drag and drop makes it easy to move text, images and files between apps just by touching them. Make your document more engaging by dropping in a photo. Or simply add an attachment to your email. You can even select multiple items to move with a few taps of a finger. Retina Display, As Beautiful As It Is Functional The 9.7-inch Retina display is an immersive way to experience all the things you can do with iPad.",
        "ps_category": "Computers & Accessories\/Tablets",
        "merchant_key": "scan.co.uk",
        "product_name": "Apple iPad 9.7\" 32GB Rose Gold Tablet",
        "price_history": {
          "2018-07-26": "318.98",
          "2018-08-10": "312.49",
          "2018-09-06": "319.00",
          "2018-11-11": "311.44"
        },
        "delivery_cost": null,
        "latest_price": "311.44",
        "product_id": "scan.co.uk_91110_gb1111",
        "linked_product_id": "LCUJa7Fa",
        "currency": "USD",
        "ps_brand": "Apple",
        "merchant_deep_link": "https:\/\/www.scan.co.uk\/products\/97-apple-ipad-32gb-gold-ips-retina-2gb-ram-8mp-rearplusfront-facetime-camera-dual-band-ac-wifi-bt-42",
        "ps_image_suffix": "assets/product-placeholder.jpg",
        "brand_image_suffix": "../assets/images/test/bicycle.jpeg",
        "merchant_star_rating": 5,
        "merchant_review_count": 7305
      },
      {
        "merchant": "Hughes",
        "description": "MR7JN2B-A 9.7\" IPad with 32GB Memory and A10 Processor in Gold",
        "ps_category": "Computers & Accessories\/Tablets",
        "merchant_key": "hughes.co.uk",
        "product_name": "Apple MRJN2B-A",
        "price_history": {
          "2018-04-27": "319.99"
        },
        "delivery_cost": null,
        "latest_price": "319.99",
        "product_id": "hughes.co.uk_apl-mrjn2b-a_gb1111",
        "linked_product_id": "LCUJa7Fa",
        "currency": "GBP",
        "ps_brand": "Apple",
        "merchant_deep_link": "https:\/\/www.hughes.co.uk\/product\/computing\/tablet-pc-s\/tablet-pcs\/apple\/mrjn2b-a",
        "ps_image_suffix": "assets/product-placeholder.jpg",
        "brand_image_suffix": "../assets/images/test/bicycle.jpeg",
        "merchant_star_rating": 4,
        "merchant_review_count": 10413
      },
      {
        "merchant": "Argos",
        "description": "iPad. Like a computer. Unlike any computer. Create, learn, work, and play like never before. An immersive 9.7-inch Multi-Touch Retina display. A10 Fusion chip with the power and capability youd expect from a computer. Now supports Apple Pencil - sold separately. Advanced 8MP camera. FaceTime HD camera. Touch ID. Fast wireless. All-day battery life. Over a million apps available on the App Store, including augmented reality experiences. And thats all in a thin, durable, aluminium design that weighs just a pound. iOS 11 makes iPad more powerful, personal, and intelligent, so you can do more than ever before. iPad. Theres nothing else quite like it. Display: 9.7in multi-touch screen. LED backlit display with iPS technology. Retina display - features over three million pixels for a more crisp and vibrant experience. 2048 x 1536 resolution at 264 pixels per inch. Fingerprint resistant coating. Features: Support for simultaneous display of multiple languages and characters... - Technology > iPad, tablets and E-readers > iPad - Gold - 32GB - Adult",
        "ps_category": "Computers & Accessories\/Tablets",
        "merchant_key": "argos.co.uk",
        "product_name": "iPad 2018 6th Gen 9.7 Inch Wi-Fi 32GB- Gold",
        "price_history": {
          "2018-03-30": "319.00"
        },
        "delivery_cost": null,
        "latest_price": "319.00",
        "product_id": "argos.co.uk_8145053_gb1111",
        "linked_product_id": "LCUJa7Fa",
        "currency": "GBP",
        "ps_brand": "Apple",
        "merchant_deep_link": "https:\/\/www.argos.co.uk\/product\/8145053?_$ja=tsid:63813|acid:PriceSearcher|agid:Technology+%2f+iPad%2c+tablets+and+E-readers+%2f+iPad|tid:8145053",
        "ps_image_suffix": "assets/product-placeholder.jpg",
        "brand_image_suffix": "../assets/images/test/bicycle.jpeg",
        "merchant_star_rating": 4,
        "merchant_review_count": 61610
      },
      {
        "description": "If the computer were invented today, what would it look like? It would be powerful enough for any task. So mobile you could take it everywhere. And so intuitive you could use it any way you wanted - with touch, a keyboard, or even a pencil.1 In other words, it wouldn't really be a 'computer.' It would be the new iPad. A10 Fusion chip. Engineered for performance. 64-bit architecture. Four-core design. Over 3.3 billion transistors. Translation: iPad is incredibly fast. Which comes in handy when you want to edit a 4K video, play graphics-intensive games or experience the latest augmented reality apps. iPad packs enough power to use multiple apps all at once. Work on your business plan while doing research on the web while making a FaceTime call to a colleague at the same time. It's even easier than it sounds. Augmented reality (AR) is a new technology that brings virtual objects into the real world. And every aspect of iPad - from the display to the processing power to the cameras to the motion sensors - is designed to make AR apps more magical than ever before. Augmented reality apps fundamentally change what you're capable of. Learn something new whether you're inside or outside a classroom. Solve everyday problems. Immerse yourself in entertainment and games. With iPad and AR, the possibilities are endless. iPad has always been a great way to get what's in your mind down on the page. And now you have a new way to do it. Write notes, paint a watercolour or sign a lease. With Apple Pencil, you'll do it all with pixel-perfect precision and responsiveness. Use it as naturally as you would a pencil, while doing a whole lot more than you would with one. Main Features 32GB Storage 9.7-inch (diagonal) LED-backlit Multi-Touch display with IPS technology 2048-by-1536 resolution at 264 pixels per inch (ppi) Fingerprint-resistant oleophobic coating Operating System: Apple iOS 11",
        "ps_category": "Computers & Accessories",
        "merchant": "Amazon Marketplace",
        "merchant_key": "marketplace.amazon.co.uk",
        "product_name": "Apple iPad 2018 Quad Core 9.7\" IPS Apple iOS Gold 32GB Tablet, Bluetooth and Camera",
        "price_history": {
          "2018-06-12": "304.00",
          "2018-06-14": "302.00",
          "2018-07-20": "268.57",
          "2018-08-20": "318.50",
          "2018-09-30": "307.00",
          "2018-11-09": "297.00",
          "2018-11-13": "304.00"
        },
        "delivery_cost": null,
        "latest_price": "304.00",
        "product_id": "B07BTCHV3H_gb1512",
        "linked_product_id": "LCUJa7Fa",
        "currency": "GBP",
        "ps_brand": "Apple",
        "merchant_deep_link": "https:\/\/www.amazon.co.uk\/gp\/offer-listing\/B07BTCHV3H\/ref=asc_df_B07BTCHV3H1542196800000?ie=UTF8&condition=new&tag=pricesearch01-21&creative=22278&creativeASIN=B07BTCHV3H&linkCode=df2",
        "ps_image_suffix": "assets/product-placeholder.jpg",
        "brand_image_suffix": "../assets/images/test/bicycle.jpeg",
        "merchant_star_rating": 2,
        "merchant_review_count": 10710
      }
    ]
  },
  "success": true,
  "error": null
}
